{
    "about" : {
        "title" : "ABOUT ME",
        "subtitle" : "Maxime BROUSSART",
        "date" : "Software engineer & Creative Technologist student",
        "description" : "➡️ ➡️ ➡️ LOOKING FOR A 6-MONTH INTERNSHIP FROM MARCH 1st, 2023 ⬅️ ⬅️ ⬅️\n📩 maxime.broussart@edu.devinci.fr 📩\n\nI am a Creative Technology Master's student from France studying computer science, software engineering, programming, UX, and Human-Computer Interaction. Curious and passionate about the sciences, I wish to use my creativity and emerging technologies to improve human life, especially in the field of software engineering.\n\nMy current flagship project is an interactive pool, an augmented reality pool table based on  a camera-projector system, to improve mathematics and physics learning through games (look at the pool table on the planet!).\n\nMy favorite programming languages are Python, Javascript and C#, and I feel very comfortable with the UNIX environment, API protocols, and web development. I also love electronic prototyping.\n\nIn my freetime, I practice rowing at a national competition level (Double 2022 French champion). Board member of my rowing club Boulogne 92 ACBB, I am involved in the event committee. I also co-created and served as the president of 'Aviron De Vinci', my school's student rowing association.\n\nI am currently looking for a 6-month internship outside of France from March 1st, 2023, in the field of software engineering, computer vision, web development, and/or augmented reality, ideally in a R&D department. I am open to any proposal, and I am very motivated to learn new things and to work on new projects!",
        "project_image" : "/img/maxime.jpg",
        "project_link" : "https://www.linkedin.com/in/maxime-broussart-a0b0b0170/",
        "github_link" : "https://github.com/maxbroubrou",
        "credits": "© 2022 Maxime Broussart\nHello there!" 
    },
    "pool_table" : {
        "title" : "Interactive pool project",
        "subtitle" : "An augmented reality pool table to improve education",
        "date" : "November 2021 - Current",
        "description" : "The interactive pool is a mathematics and physics learning platform using gamification. It is a classic billiards table augmented by a projector-camera system. A camera looks down the table and a projector displays information on the table. This setup transforms the pool table into an augmented reality (AR) platform and allows an interaction between the real-world movements detected by the camera and the computer that displays information on the table.\n\nThis project enabled me to learn multiple skills in computer vision (such as ball tracking and hand recognition), as well as web application development, networking, design user experience, and programming in Python and Javascript. It is also a great experience to work as a team, as I have been developing with peers a software operating system for augmented reality interfaces with a scalable and performance-oriented design: GOSAI.\n\nWe are currently conducting a scientific study to assess how interactions with the augmented pool table can lead to measurable improvements in the acquisition of abstract math concepts.",
        "project_image" : "img/pool_table.jpg",
        "project_link" : "https://dvic.devinci.fr/projects/educationnal-billard",
        "github_link" : "https://github.com/GOSAI-DVIC/interactive-pool",
        "credits": "This project belongs to my innovation laboratory DVIC. \nI must thank all the other contributors of the project : Louis Geisler, Thomas Juldo, Yliess Hati, under the supervision of Dr. Clément Duhart, and Dr. Xiao Xiao."
    },
    "smart_lock" : {
        "title" : "Smart Lock project",
        "subtitle" : "An electronic lock with RFID card protection",
        "date" : "June 2021 - October 2021",
        "description" : "Smart Lock is a project that aims to secure and manage the inventory of lockers within our lab space. Users can open the lockers with their student card depending on their access permission, managed in a back-end server. Users can register their badge in the database directly from the smart-lock. The system has been engineered  to be replicable, and easily modifiable.\n\nThe system is powered by a Raspberry Pi V3 single-board computer, and the locker is moved by a solenoid. Student's cards are read with an RFID reader. A touchscreen on the door permits interaction with the user, especially for locker inventory management and for registering new users.",
        "project_image" : "/img/smart_lock.jpg",
        "project_link" : "https://maximebroussart.myportfolio.com/smart-lock",
        "github_link" : "https://github.com/maxbroubrou/SMART-LOCK",
        "credits": "I realized this project in collaboration with Louis Bader (master student), under the supervision of Dr. Clément Duhart. A big thanks to Grégor Jouet, PhD student in computer sciences & artificial intelligence, for his advice and contributions on the project."
    },
    "mobile_tinsels": {
        "title" : "Mobile tinsel project",
        "subtitle" : "A portable waterproof LED tinsels",
        "date" : "October 2021 - December 2021",
        "description" : "This project is a portable LED tinsel that can be used for art decoration or aesthetic usage. It is waterproof and can be used outside. These lights also equip me with lights for my early rowing sessions before sunrise. \n\nPowered by a battery, its light patterns can be controlled with a button. A micro-controller ATtiny 85 instructs the animations program of the system. \n\nAs a challenge, I programmed the MCU in AVR-C (register programming). I programmed the LED animations through periodic cycles close to the bytes, working with registers and interrupts. To create smooth light animations, I used trigonometric functions with non-regular periods.",
        "project_image" : "/img/mobile_tinsels.jpg",
        "project_link" : "",
        "github_link" : "https://github.com/maxbroubrou/SMART-LOCK",
        "credits": "A big thanks to Brice Parilusyan, PhD student in soft robotics, for his advice and contributions on the project." 
    },
    "satellite": {
        "title" : "Earth selfie with a custom antenna",
        "subtitle" : "DIY Antenna + SDR to detect satellite signal",
        "date" : "August 2021",
        "description" : "During the orientation Bootcamp at the very beginning of my Creative Technology engineering masters program, we went to the countryside and built our own antenna from basic materials: aluminum, co-axial cable, and wood! \n\nPer group of four, we first built a V-dipole antenna: two aluminum rods connected to a choc block in order to obtain a 'V-shape'. The 2 dipole legs must form an angle of 120°, and the rod length depends on the targeted frequency. In our case, each leg must measure 53,4 cm. With my team, we challenged ourselves to build  a double cross-antenna. The construction of this second antenna had the goal of better receiving the electromagnetic waves thanks to its 4 rods placed in double-crossing. This second antenna demonstrated its better performances: we were rarely losing the radio signal, even through walls. \n\nTo interpret the electromagnetic wave into a usable signal, we used a Sofware-Defined Radio (SDR). An SDR system is a configurable radio communication system that performs many hardware protocols such as amplification, filtering, analog/digital conversions, encryption, or network routing. In our experience, the SDR allowed us to convert the Radio frequencies directly into an output signal, usable by our computer. It is notably thanks to the SDR that we can choose the frequencies we want to receive. An SDR is composed of hardware and software parts. We used GQRX (Linux) as a radio receiver software to target and receive specific frequencies. We were able to listen to the FM radio, but our main objective was to get satellite signals!\n\nNOAA satellites are American weather satellites. These spacecraft were launched for the first time more than 40 years ago. They are still in space and send earth picture data continuously by Automatic Picture Transmission (APT) in the frequency range of 137-138 MHz. NOAA satellites pass over Europe a few times per day with different elevation angles, depending on the receiver position. The closer to 90° is the elevation angle, the better is the received signal. From websites and software (such as Gpredict), we can look up their passage time. We recorded their emitting signal with our custom antenna and processed the signal to get the Earth picture!",
        "project_image" : "/img/satellite.jpg",
        "project_link" : "https://maximebroussart.myportfolio.com/earth-selfie-with-a-custom-antenna",
        "github_link" : "https://github.com/wimausberlin/noaa-satellites",
        "credits": "A big thanks to my teammates for this nice, fun and challenging workshop: Wim Poignon, Louis-Marie Restout, and Romain Manoïlov. \nAnd to DVIC staff for the organization of this workshop, Gershon Dublon, at the origin of the idea." 
    },
    "rowing" : {
        "title" : "Engaged rowing competitor",
        "subtitle" : "My passion and leisure activity",
        "date" : "Since 2013",
        "description" : "Rigor, efficiency, and surpassing myself have been my drivers to help me succeed in my engineering project goals.  I gained this work ethic from rowing, a very demanding sport which, after nine years of effort and competition, culminated in winning two French championships titles in 2022 (in senior lightweight coxless four, and in senior under-23 mixed 8). I am a member of the Boulogne 92 ACBB rowing club, of the city of Paris, and I am currently in the senior-elite category. \n\nActive in the student life of my school, I also co-founded and chaired Aviron De Vinci, a student rowing association. I led and coached a group of 30 students to the national university championships last year, and am currently co-organizing a competition in the heart of Paris, expecting 300 athletes.",
        "project_image" : "/img/rowing.jpg",
        "project_link" : "https://www.boulogne92.fr/blog/index.php?post/2022/06/05/Championnats-de-France-bateaux-longs-%C3%A0-Vichy,-du-3-au-5-juin-2022",
        "github_link" : "",
        "credits": "I thank my coaches, my teammates, my friends and family for their support and encouragement." 
    },
    "puckle" : {
        "title" : "PUCKLE",
        "subtitle" : "Kickstarter : a fun puck throwing game",
        "date" : "Since October 2021",
        "description" : "Puckle is a kickstarter that I undertook as a team. It consisted of designing a product, optimizing it, canvassing factories, launching a crowdfunding campaign on the kickstarter website, and finally delivering it to backers.\n\nWe named it 'Puckle', it is a throwing game made of silicone disks inspired by the famous French game “la petanque,” typically played outdoors with metal balls. Our silicone disks allow the beloved game to be played anywhere, indoors and outdoors, without the risk of breaking your floors or your children's feet! The game is simple and full of surprises: it creates fun and happy moments with your friends, family, colleagues, children, or whomever!\n\n But with an additional rule that changes everything! Take a look on the Puckle website page to know more about Puckle's story!",
        "project_image" : "/img/puckle.jpg",
        "project_link" : "https://www.kickstarter.com/projects/puckle/quickstarter-puckle-a-fun-throwing-game   ",
        "github_link" : "",
        "credits": "Thanks to my amazing teammates for this great adventure: Romain Manoïlov, Adem Rahal, Louis-Marie Restout, and Hugo Dardill. \nThanks a lot to Charlie Zehnlé for coaching us on the project, Clément Duhart and Marc Teyssier for allowing us to embark on this real-world adventure." 
    }
}